// 객체 Object

/* 객체란 ?
자바스크립트는 객체기반의 스크립트 언어
자바스크립트를 이루는 거의 모든 것이 객체이다.
자바스크립트의 객체는 키(key)과 값(value)으로 구성된 프로퍼티(Property)들의 집합이다.
프로퍼티 값으로 함수를 사용할 수도 있으며 프로퍼티 값이 함수일 경우, 일반 함수와 구분하기 위해 메소드라 부른다.
*/

/* 프로퍼티란?
프로퍼티는 프로퍼티 키(이름)와 프로퍼티 값으로 구성
프로퍼티 키는 프로퍼티를 식별하기 위한 식별자

프로퍼티 키 : 빈 문자열을 포함하는 모든 문자열 또는 symbol 값
프로퍼티 값 : 모든 값

특징 :
1. 이미 존재하는 프로퍼티 키를 중복 선언하면 나중에 선언한 프로퍼티가 먼저 선언한 프로퍼티를 덮어쓴다
2. 프로퍼티 키에 문자열이나 symbol 값 이외의 값을 지정하면 암묵적으로 타입이 변환되어 문자열이 된다.
3. 배열과는 달리 객체는 프로퍼티를 열거할 때 순서를 보장하지 않는다.
*/

/* 메소드
프로퍼티 값이 함수일 경우, 일반 함수와 구분하기 위해 메소드라 부른다
=> 객체에 제한되어 있는 함수
*/

